# WARNING: look at this file before running it on your local machine
# WARNING: To run this file, you need to have brew(homebrew) installed
# NOTE: use `brew bundle` to run the file

# --- Editors ---
brew "neovim"
brew "vim"

# --- Networking & transfers ---
brew "curl"
brew "wget"
brew "httpie"
brew "openssh"

# --- Version control ---
brew "git"

# --- Compilers & languages ---
brew "gcc"         # gcc, g++, cc
brew "rustup-init" # Rust toolchain installer
brew "node"        # nodejs
brew "nvm"         # A version manager for nodejs
brew "python@3.12" # gives python3 & pip3
brew "deno"
brew "go"

# --- File navigation & search ---
brew "ripgrep"     # fast grep alternative
brew "fd"          # user-friendly find
brew "bat"         # cat with syntax highlighting
brew "eza"         # A better ls commmand
brew "fzf"         # fuzzy finder

# --- System monitoring ---
brew "btop"        # Better top/htop
brew "lsof"

# --- Archiving & compression ---
brew "xz"

# --- Text & data processing ---
brew "jq"          # JSON processor
brew "yq"          # YAML processor
## Your distro probobly ships with these tools, if it doesn't, then uncomment the following 2 lines
# brew "sed"
# brew "awk"
# brew "coreutils"   
# brew "findutils"

# --- Security ---
brew "gnupg"
brew "openssl@3"

# --- Misc essentials ---
brew "make"
brew "cmake"

