tap "homebrew/core"

# --- Editors ---
brew "neovim"
brew "vim"

# --- Networking & transfers ---
brew "curl"
brew "wget"
brew "httpie"      
brew "openssh"

# --- Version control ---
brew "git"

# --- Compilers & languages ---
brew "gcc"         # gcc, g++, cc
brew "rustup-init" # Rust toolchain installer
brew "node"
brew "nvm"
brew "python@3.12" # gives python3 & pip3


# --- File navigation & search ---
brew "ripgrep"     # fast grep alternative
brew "fd"          # user-friendly find
brew "tree"
brew "bat"         # cat with syntax highlighting
brew "eza"         
brew "fzf"         # fuzzy finder

# --- System monitoring ---
brew "htop"
brew "btop"
brew "lsof"

# --- Archiving & compression ---
brew "xz"

# --- Text & data processing ---
brew "jq"          # JSON processor
brew "yq"          # YAML processor
brew "sed"
brew "awk"
brew "coreutils"   
brew "findutils"

# --- Security ---
brew "gnupg"
brew "openssl@3"

# --- Misc essentials ---
brew "make"
brew "cmake"

